[{"bio":"Laszlo is a senior software engineer at The Qt Company in Oslo, Norway. He is the maintainer of Qt's OpenGL support, the Embedded Linux platform plugins, and has recently worked on the Qt 3D Studio runtime as well. He is currently occupied with enabling Qt on Vulkan, Metal, and other graphics APIs, thus ensuring \"Qt Everywhere\" stays true in the future too.","conferences":[],"isDeprecated":false,"name":"Laszlo Agocs","publicName":"","sessions":["4318"],"sortGroup":"A","sortKey":"AGOCS","speakerId":4256,"speakerImage":4256,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Jim Albamont　様","publicName":"","sessions":["4613"],"sortGroup":"A","sortKey":"ALBAM","speakerId":4587,"title":"KDAB"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Caleb Alden　様","publicName":"","sessions":["4608"],"sortGroup":"A","sortKey":"ALDEN","speakerId":4582,"title":"Green Hills Software LLC"},{"bio":"Senior Software Engineer and team lead at KDAB, Nicolas has actively developed with Qt since 2001 and is a founding member of Qtfr, the French Qt community site. He has worked on multiple Qt widgets or QML projects, with a particular emphasis on API design and software architecture. He has held Qt training classes for companies such as Michelin, Ford and ST-Ericsson. Nicolas holds an MSc in Computer Science.","conferences":[],"isDeprecated":false,"name":"Nicolas Arnaud-Cormos","publicName":"","sessions":["4338"],"sortGroup":"A","sortKey":"ARNAU","speakerId":4272,"speakerImage":4272,"title":"KDAB"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Nicolas Arnaud-Cormos　様","publicName":"","sessions":["4607"],"sortGroup":"A","sortKey":"ARNAU","speakerId":4581,"title":"KDAB"},{"bio":"Sumer Bains is a Director of Software services at Verolt Engineering Limited. He is an automotive professional with over 20 years of experience in automotive infotainment systems and telematics.  At Verolt, he manages the customer engagements for embedded software development services.","conferences":[],"isDeprecated":false,"name":"Sumer Bains","publicName":"","sessions":["4590"],"sortGroup":"B","sortKey":"BAINS","speakerId":4591,"speakerImage":4591,"title":"Verolt Engineering Limited"},{"bio":"Alex Blasche holds a degree in Computer Science (BCS) and a Master in Information Technologies (M.I.T.). He has been part of Qt Development for over 15 years. When he joined Trolltech, he started as an embedded software developer using Qt 2. Later he contributed to Qtopia/Qt Extended and in 2008 became a technical lead for the design and development of those APIs. Following the announcement of Qt 5 he continued by porting the API’s to Qt 5 and is the maintainer for some of them. His focus of work for the last years has been on Qt Bluetooth, Qt SerialBus and Industrial Automation.","conferences":[],"isDeprecated":false,"name":"Alex Blasche","publicName":"","sessions":["4328"],"sortGroup":"B","sortKey":"BLASC","speakerId":4275,"speakerImage":4275,"title":"The Qt Company"},{"bio":"Jeremias Bosch is a Senior Developing Technical Project Manager for basysKom GmbH, where he is consulting customers on embedded HMI applications. He is responsible for the system/software-architecture and the development within customer projects as well as the project management. He has over 11 years of experience in developing HMIs. Since 2011 he has supported basysKom customers in delivering multiple large and medium scale QtQuick applications in industries such as Automotive and Aerospace. He holds a Diploma of Computer Science from the University of Applied Sciences in Isny.","conferences":[],"isDeprecated":false,"name":"Jeremias Bosch","publicName":"","sessions":["4381","4366"],"sortGroup":"B","sortKey":"BOSCH","speakerId":4266,"speakerImage":4266,"title":"basysKom"},{"bio":"Jeremias Bosch is a Senior Developing Technical Project Manager for basysKom GmbH, where he is consulting customers on embedded HMI applications. He is responsible for the system/software-architecture and the development within customer projects as well as the project management. He has over 11 years of experience in developing HMIs. Since 2011 he has supported basysKom customers in delivering multiple large and medium scale QtQuick applications in industries such as Automotive and Aerospace. He holds a Diploma of Computer Science from the University of Applied Sciences in Isny.","conferences":[],"isDeprecated":false,"name":"Jeremias Bosch","publicName":"","sessions":[],"sortGroup":"B","sortKey":"BOSCH","speakerId":4306,"speakerImage":4306,"title":"basysKom"},{"bio":"Florian Bruhin (\"The Compiler\") is a long-time contributor and maintainer of both the pytest framework and the pytest-qt plugin. He is a user of PyQt since 2013 with his qutebrowser project, a keyboard-focused web browser based on Python and QtWebEngine. In 2015, he discovered pytest - since then, he has given talks and conducted workshops about pytest at various conferences and companies.","conferences":[],"isDeprecated":false,"name":"Florian Bruhin","publicName":"","sessions":["4347"],"sortGroup":"B","sortKey":"BRUHI","speakerId":4290,"speakerImage":4290,"title":"Bruhin Software "},{"bio":"Mathieu is passionate about combining business, trade and technology. Born in France, Mathieu holds a Master of Science in Electrical Engineering and Information Technology from Lyon and Munich. Through positions at MAN Trucks and Volvo, he has gained insights into the development and key trends in the mobility industry. Mobility in metropolises has always fascinated Mathieu. At the same time, he noticed how difficult it can be to fully exploit the potential of large cities. When he met Elias Atahi and Pascal Blum during his studies, he didn't hesitate to found the electric scooter startup unu with them to turn the mobility scene upside down.","conferences":[],"isDeprecated":false,"name":"Mathieu Caudal","publicName":"","sessions":["4415"],"sortGroup":"C","sortKey":"CAUDA","speakerId":4593,"speakerImage":4593,"title":"unu"},{"bio":"Vice President, Software Business PMO (Project Management Office), CTO Division, LG Electronics.\r\n\r\nHelen is a vice president of LG Electronics overseeing the incubation of new software solutions and service business. She has been working in the software domain for almost 25 years and before becoming the vice president in software business area, she led the enterprise wide software engineering practices and capabilities.","conferences":[],"isDeprecated":false,"name":"Heewon (Helen) Choi","publicName":"","sessions":["4407"],"sortGroup":"C","sortKey":"CHOI","speakerId":4545,"speakerImage":4545,"title":"LG Electronics"},{"bio":"Software Engineer at KDAB, Albert has been using Qt since 2002. Since then, he has applied Qt in a broad range of industries ranging from transit simulation, medical devices to games and many more. His main expertise is in C++ and Qt/QML. In 2005, Albert won KDE’s Akademy Award for his work on improving PDF rendering on Free Software platforms. Albert holds an MSc in Computer Engineering.","conferences":[],"isDeprecated":false,"name":"Albert Astals Cid","publicName":"","sessions":["4369"],"sortGroup":"C","sortKey":"CID","speakerId":4261,"speakerImage":4261,"title":"KDAB"},{"bio":"","conferences":[],"isDeprecated":false,"name":"ユーザー企業、スポンサー企業、<br>The Qt Company","publicName":"","sessions":["4576","4644","4645","4646","4647"],"sortGroup":"C","sortKey":"COMPA","speakerId":4575,"title":""},{"bio":"","conferences":[],"isDeprecated":false,"name":"The Qt Company","publicName":"","sessions":["4636","4576","4616"],"sortGroup":"C","sortKey":"COMPA","speakerId":4589,"title":""},{"bio":"","conferences":[],"isDeprecated":false,"name":"The Qt Company社員","publicName":"","sessions":["4630"],"sortGroup":"C","sortKey":"COMPA","speakerId":4619,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"The Qt Company社員","publicName":"","sessions":[],"sortGroup":"C","sortKey":"COMPA","speakerId":4622,"title":"The Qt Company"},{"bio":"Software developer and problem solver. Currently working as Qt/C++ consultant in sunny Barcelona after spending many years in (the less sunny) London where he worked for some of the top game companies like Nintendo, SEGA and King, but also as an indie game developer releasing few games on his own. Before that he got an MSc in Computer Science back in Naples, his hometown. That's when he started to use Qt in his coding projects. Occasionally contributes to Qt Creator development and writes about Qt development on his blog.","conferences":[],"isDeprecated":false,"name":"Davide Coppola","publicName":"","sessions":["4321"],"sortGroup":"C","sortKey":"COPPO","speakerId":4277,"speakerImage":4277,"title":"Viking Software"},{"bio":"After his PhD in the field of algorithmic game theory, Andreas joined CLAAS E-Systems in 2016. Since then, he has been working on embedded control units (ECUs) that help users to control big agriculture machines. His main focus lies on the base software for graphical ECUs, where Linux desktop technologies meet the shallows of embedded hardware.","conferences":[],"isDeprecated":false,"name":"Andreas Cord-Landwehr","publicName":"","sessions":["4351"],"sortGroup":"C","sortKey":"CORD-","speakerId":4303,"speakerImage":4303,"title":"CLAAS E-Systems"},{"bio":"Alexandru is a software engineer at the Qt Company who was involved in a few different Qt areas. He helped maintain the Qt WebEngine module across all three desktop platforms, improved many parts of the Qt For Python project (build system overhaul, fixes for the QML and Python interop). Currently, he is working on getting Qt5/6 to build with CMake.","conferences":[],"isDeprecated":false,"name":"Alexandru Croitor","publicName":"","sessions":["4336"],"sortGroup":"C","sortKey":"CROIT","speakerId":4291,"speakerImage":4291,"title":"The Qt Company"},{"bio":"Senior Software Engineer at KDAB, Giuseppe is a long-time contributor to Qt, having used Qt and C++ since 2000, and is an Approver in the Qt Project. His contributions in Qt range from containers and regular expressions to GUI, Widgets and OpenGL. A free software passionate and UNIX specialist, before joining KDAB, he organized conferences on opensource around Italy. He holds a BSc in Computer Science.","conferences":[],"isDeprecated":false,"name":"Giuseppe D'Angelo","publicName":"","sessions":["4354"],"sortGroup":"D","sortKey":"D'ANG","speakerId":4257,"speakerImage":4257,"title":"KDAB"},{"bio":"Simon Davydov is a team lead of Training and Simulators group at Sukhoi JSC where he gets to work on a variety of training systems including dome jet plane simulators, VR and AR. He’s been developing with Qt for over 10 years.","conferences":[],"isDeprecated":false,"name":"Simon Davydov","publicName":"","sessions":["4339"],"sortGroup":"D","sortKey":"DAVYD","speakerId":4285,"speakerImage":4285,"title":"Sukhoi JSC"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Thomas Delteil　様","publicName":"","sessions":["4602"],"sortGroup":"D","sortKey":"DELTE","speakerId":4573,"title":"Amazon Web Services, Inc"},{"bio":"Loves to work on embedded systems since 2008. Worked for six years as an embedded Linux engineer for a wireless router manufacturer and professional services provider. Works since 2018 as a Field Application Engineer for Toradex AG.","conferences":[],"isDeprecated":false,"name":"Stefan Eichenberger","publicName":"","sessions":["4383"],"sortGroup":"E","sortKey":"EICHE","speakerId":4267,"speakerImage":4267,"title":"Toradex"},{"bio":"Valter Minute: He has been working on embedded devices since 1999 and loves to play with any kind of thing that can run some forms of Software. Works for Toradex since 2013 developing drivers and BSPs.\r\n\r\nStefan Eichenberger: Loves to work on embedded systems since 2008. Worked for six years as an embedded Linux engineer for a wireless router manufacturer and professional services provider. Works since 2018 as a Field Application Engineer for Toradex AG.","conferences":[],"isDeprecated":false,"name":"Valter Minute & Stefan Eichenberger","publicName":"","sessions":["4378","4379"],"sortGroup":"E","sortKey":"EICHE","speakerId":4278,"speakerImage":4278,"title":"Toradex"},{"bio":"Vitaly is senior software engineer at The Qt Company, Qt Quick and Widgets team. Before start working on Qt, he was designing and developing software for mathematical modeling and VFX. He has been designing and developing software with using Qt for about 8 years. Vitaly holds Ph.D from the Moscow State Mining University with a specialization geoinformatics.","conferences":[],"isDeprecated":false,"name":"Vitaly Fanaskov","publicName":"","sessions":["4544"],"sortGroup":"F","sortKey":"FANAS","speakerId":4541,"speakerImage":4541,"title":"The Qt Company"},{"bio":"Christian Feldbacher is CEO & Co-Founder of FELGO GmbH (previously called V-Play), a technology company specialized on Qt tool development and Qt development services. He has more than 15 years’ experience in software development with a strong focus on game and mobile app development. After 15 years C++ and 10 years Qt C++ development, Christian was overwhelmed by Qt Quick and the combination of performance and code efficiency. His passion for games and experience in Qt, game, and mobile platform development led to the creation of V-Play Engine, which was publicly launched in January 2013. Besides working on Felgo, Christian joins game jams and teaches university students how to develop with Qt. Previous Presentation Experience: Christian gave 7 talks about cross-platform app development with Qt at Qt World Summit 2017, 2016, 2015 and 2014. He presented a lightning talk at 2013’s Qt Developer Days in Berlin, where he won the “Most Innovative Talk” award. Christian has started to work as a tutor for programming and mathematics during his Bachelors and Master’s degree and presented complex topics on a weekly regular basis. After finishing the Mobile Computing Master program, he started to work as a lecturer at the University of Applied Sciences Hagenberg, teaching Bachelor and Master students cross-platform development with Qt. Besides presentations for students as a teacher, he often speaks on big public events. Examples are Global Game Jam Austria, Knowledge Night about Cross-Platform Development or Game Stage in Ars Electronica Center. As Co-Founder of V-Play, he also presents V-Play on conferences and Startup competitions on a regular basis, like at Game Developers Conference in Cologne or a talk at Microsoft Headquarter in Austria about cross-platform development with Qt.","conferences":[],"isDeprecated":false,"name":"Christian Feldbacher","publicName":"","sessions":["4367","4332"],"sortGroup":"F","sortKey":"FELDB","speakerId":4295,"speakerImage":4295,"title":"FELGO"},{"bio":"Rik Ferguson, Vice President of Security Research at Trend Micro, is one of the leading experts in information security. He is also a Special Advisor to Europol’s European Cyber Crime Centre (EC3). In April 2011 Rik was inducted into the Infosecurity Hall of Fame.","conferences":[],"isDeprecated":false,"name":"Rik Ferguson","publicName":"","sessions":["4412"],"sortGroup":"F","sortKey":"FERGU","speakerId":4440,"speakerImage":4440,"title":"Trend Micro"},{"bio":"Jordi is a Qt certified C++ specialist, with +10 years of experience in Qt development. He has been involved in the creation of data-intensive ERP applications, embedded machine control systems, process optimization, and forecasting software. He's currently working at Viking Software as a software developer","conferences":[],"isDeprecated":false,"name":"Jordi Pujol Foyo","publicName":"","sessions":["4324"],"sortGroup":"F","sortKey":"FOYO","speakerId":4284,"speakerImage":4284,"title":"Viking Software"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Christian Franke　様","publicName":"","sessions":["4612"],"sortGroup":"F","sortKey":"FRANK","speakerId":4586,"title":"froglogic"},{"bio":"froglogic GmbH is a software company based in Hamburg, Germany with additional offices in the USA and Poland with over 3,000 customers world-wide. froglogic is well known for its automated testing suite Squish with its flagship product Squish GUI Tester, the market-leading automated testing tool for GUI applications based on Qt, Java AWT/Swing, SWT/RCP and JavaFX, Mac OS X Carbon/Cocoa, Windows MFC, .NET and WPF, iOS Cocoa Touch, Android and for HTML/Ajax/Flex-based web applications running in a variety of web browsers. In addition, froglogic offers the professional, cross-platform C, C++, C# and Tcl code analysis tool Coco Code Coverage. Find out more about us and our products at https://www.froglogic.com.","conferences":[],"isDeprecated":false,"name":"froglogic ","publicName":"","sessions":["4530"],"sortGroup":"F","sortKey":"FROGL","speakerId":4531,"speakerImage":4531,"title":""},{"bio":"Kevin has actively developed with Qt/C++ since 2006 and has a special interest in tooling and profiling. He’s an active contributor to KDAB’s GammaRay analyzer (a high-level Qt application debugger) and has a strong emphasis on state machine tooling. He is co-maintainer of the KDevelop IDE, a powerful C/C++ development environment backed by Clang, and is pushing for cross-platform success inside KDE. Kevin holds a Masters Degree in Computer Science.","conferences":[],"isDeprecated":false,"name":"Kevin Funk","publicName":"","sessions":["4370","4374"],"sortGroup":"F","sortKey":"FUNK","speakerId":4265,"speakerImage":4265,"title":"KDAB"},{"bio":"Ekke is Qt Champion 2016 and works as an Independent Software architect in the domain of business applications (ERP). He has over 40 years of experience in the domain. He likes to develop high-quality mobile apps for customers around the world. Ekke is a well-known speaker at national and international developer conferences, he writes articles and blogs at http://ekkes-corner.org. On Twitter he is @ekkescorner. Find more info on native mobile app development at http://appbus.org, which also has a special blog series about x-platform Qt development http://j.mp/qt-x. On Github (https://github.com/ekke) you'll find many Open Source Projects using QtQuickControls2. Ekke lives in the south of Germany and in his spare time he likes to go backpacking to the Greek Islands.","conferences":[],"isDeprecated":false,"name":"Ekkehard Gentz","publicName":"","sessions":["4361"],"sortGroup":"G","sortKey":"GENTZ","speakerId":4307,"speakerImage":4307,"title":"Qt Champion"},{"bio":"Olivier Goffart started working with Qt 20 years ago with his involvement in KDE. He was then hired by Trolltech to work on Qt in 2007 and has been working on various areas of Qt including the itemview framework, the widget stylesheets, QtScript, the QObject internals and threading primitives. He is now the co-founder of Woboq, a company based in Berlin focusing on Qt.","conferences":[],"isDeprecated":false,"name":"Olivier Goffart","publicName":"","sessions":["4340","4674"],"sortGroup":"G","sortKey":"GOFFA","speakerId":4311,"speakerImage":4311,"title":"Woboq"},{"bio":"Being a developer since 2005, Denis experienced in Qt since its version 3. Nowadays he is a certified Qt/QML/C++ specialist who works as a Qt/QML consultant for Viking Software on projects of different scopes and contexts - from embedded geographic information systems to web communications and development tools for European Space Agency.","conferences":[],"isDeprecated":false,"name":"Denis Gofman","publicName":"","sessions":["4362"],"sortGroup":"G","sortKey":"GOFMA","speakerId":4305,"speakerImage":4305,"title":"Viking Software"},{"bio":"Bram is a senior software developer at Luxoft Automotive where he leads and maintains the reference UI of Qt Automotive Suite. He holds a Master's degree in Automotive Software Engineering. Bram has been working on HMI and UI for more than 9 years in various fields, including industrial automation and automotive industry. He has been developing with Qt for several years in some automotive projects with OEMs and some research projects. He also wrote a publication about the development of a framework written with Qt for dynamic 3D user interface in vehicle.","conferences":[],"isDeprecated":false,"name":"Bramastyo Harimukti","publicName":"","sessions":["4384"],"sortGroup":"H","sortKey":"HARIM","speakerId":4286,"speakerImage":4286,"title":"Luxoft Automotive"},{"bio":"Thomas Hartmann has a degree in computer science from RWTH-Aachen and more than 10 years of experience with the Qt framework. He has vast experience working as a Software Engineer in system programming, application development and providing consultancy services to customers like Parker and Ulstein. As the maintainer of the Qt Quick Designer, he is actively participating in the Open Source community of Qt. Currently, Thomas is the lead developer of the Qt Design Studio.","conferences":[],"isDeprecated":false,"name":"Thomas Hartmann","publicName":"","sessions":["4352"],"sortGroup":"H","sortKey":"HARTM","speakerId":4297,"speakerImage":4297,"title":"The Qt Company"},{"bio":"Peter has worked for more than 10 years on and with Qt; he was maintainer of the QtNetwork subsystem, and now shifted his interest more towards graphics. Peter has experience with Qt in large-scale automotive projects and is the managing director of Edelhirsch Software GmbH located in Munich, Germany.","conferences":[],"isDeprecated":false,"name":"Peter Hartmann","publicName":"","sessions":["4358"],"sortGroup":"H","sortKey":"HARTM","speakerId":4302,"speakerImage":4302,"title":"Edelhirsch Software"},{"bio":"Simon Hausmann is a Software Engineer with The Qt Company. He has invested the last 16 years in Qt and still enjoys C++. He has contributed to various Qt modules such as the QML library, core libraries, the meta-object compiler, the text renderer, and the web engine.\r\n\r\nIn his spare time, he is trying to improve his coffee brewing skills and is convinced that black filter coffee should be a food group.","conferences":[],"isDeprecated":false,"name":"Simon Hausmann","publicName":"","sessions":["4386","4625"],"sortGroup":"H","sortKey":"HAUSM","speakerId":4618,"speakerImage":4618,"title":"The Qt Company"},{"bio":"Ulf Hermann has a degree in computer science from the Humboldt University in Berlin and has been working at the Qt Company since 2013. He has mostly focused on the tooling integration between QML and Qt Creator, but also worked on Qt SCXML and wrote profiling tools for Qt Creator. Since 2019 he is the maintainer for Qt QML.","conferences":[],"isDeprecated":false,"name":"Ulf Hermann","publicName":"","sessions":["4390"],"sortGroup":"H","sortKey":"HERMA","speakerId":4254,"speakerImage":4254,"title":"The Qt Company"},{"bio":"Matthew Hungerford is the UX Team Lead for Embedded Software at ChargePoint. He is a Linux enthusiast, developing with Linux at companies such as Skype, Microsoft and now ChargePoint.  He is a maker and tech enthusiast who writes games (primarily for his kids), hacks on Arduinos and Raspberry Pis, and created ChargePoint's EV Maker Faire booth.","conferences":[],"isDeprecated":false,"name":"Matthew Hungerford","publicName":"","sessions":["4350"],"sortGroup":"H","sortKey":"HUNGE","speakerId":4287,"title":"Chargepoint"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Matthew Hungerford　様","publicName":"","sessions":["4611"],"sortGroup":"H","sortKey":"HUNGE","speakerId":4585,"title":"ChargePoint"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Hyojun Im　様","publicName":"","sessions":["4603"],"sortGroup":"I","sortKey":"IM　様","speakerId":4574,"title":"LG Electronics"},{"bio":"Jaeyoon Jung is a software engineer at LG Electronics and leading webOS graphics and build system. He has worked 17 years for LG and involved many research and productization projects. From those projects Jaeyoon has gained expertise in various area for the embedded Linux system, such as kernel, system libraries, graphics, networking and also applications running at the top. He has contributed to webOS for the last 7 years and currently is the maintainer of webOS graphics compositor Luna Surface Manager.","conferences":[],"isDeprecated":false,"name":"Jaeyoon Jung","publicName":"","sessions":["4380"],"sortGroup":"J","sortKey":"JUNG","speakerId":4309,"speakerImage":4309,"title":"LG Electronics"},{"bio":"After bailing out of his Ph.D thesis, Morten has worked as a software engineer in multiple fields and disciplines and currently he is one of the Qt experts at Viking Software. Previously Morten has programmed machines for the food industry, user interfaces for cell phones at Nokia, chat systems at Atlassian and agricultural machines at Leica. He has been freelancer selling Qt services and prototype implementation for as well industrial research as startups in the biochemical industry. With 13 years of work in a variety of businesses and technologies, having Qt as a common thread, Morten considers experience the new black.","conferences":[],"isDeprecated":false,"name":"Morten Jørgensen","publicName":"","sessions":["4373"],"sortGroup":"J","sortKey":"JØRGE","speakerId":4296,"speakerImage":4296,"title":"Viking Software"},{"bio":"The KDAB Group is a leading expert provider of Qt, C++ and OpenGL consulting, development and training services.\r\nSince 1999 KDAB’s unique software expertise has helped customers to improve quality, productivity and time to market across desktop, embedded and mobile platforms. In 2019 the KDAB Group had 90+ employees across Americas, Europe and Asia. The main offices are in Germany, France, the UK, Houston, TX (USA) and Sweden.\r\n\r\nThe majority of KDAB's customers are active within the Automotive, Biotech, Medical, Industrial Embedded, Entertainment, Government and Consumer Software industries.\r\n\r\n&nbsp;","conferences":[],"isDeprecated":false,"name":"KDAB ","publicName":"","sessions":["4535","4534","4533","4529","4528","4525","4524"],"sortGroup":"K","sortKey":"KDAB","speakerId":4526,"speakerImage":4526,"title":""},{"bio":"Markus Keller is a Senior Software Developer for Autodesk, Inc. working on VRED. He has extensive knowledge in several programming languages including C++ and Python. Over the last 15 years he has been working for several companies dealing with high end visualization and simulation for the automotive industry.\r\n\r\nHe has studied Materials Science at the Darmstadt University of Technology from 1997 to 2000 and Computer Science at the Darmstadt University of Applied Sciences from 2000 to 2006. He holds a masters degree with a focus on computer graphics.","conferences":[],"isDeprecated":false,"name":"Markus Keller","publicName":"","sessions":["4353"],"sortGroup":"K","sortKey":"KELLE","speakerId":4520,"speakerImage":4520,"title":"Autodesk"},{"bio":"Yunkwan is a software engineer at LG Electronics and joined LGE in 2012 after getting his Ph.D. in the field of programming language. Since then he has been working on SDK and tools development, and developing webOS related products such as IDE, emulator and performance monitoring tool for webOS developers.","conferences":[],"isDeprecated":false,"name":"Yunkwan Kim","publicName":"","sessions":["4664"],"sortGroup":"K","sortKey":"KIM","speakerId":4665,"speakerImage":4665,"title":"LG Electronics"},{"bio":"Lars Knoll is The Qt Company CTO and Qt Project Chief Maintainer. He has been working on Qt for more than 13 years starting as a software engineer to later leading the global Qt engineering team in Nokia before the Digia acquisition in October 2012.","conferences":[],"isDeprecated":false,"name":"Lars Knoll","publicName":"","sessions":["4411","4432","4389","4624"],"sortGroup":"K","sortKey":"KNOLL","speakerId":4433,"speakerImage":4433,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Lars Knoll","publicName":"","sessions":[],"sortGroup":"K","sortKey":"KNOLL","speakerId":4617,"title":"The Qt Company"},{"bio":"Senior Software Engineer at KDAB, Kevin is also a contributor to Qt and KDE. As a Senior Qt Trainer at KDAB, he has experiences with a lot of different use cases of Qt across industries and explores technologies and techniques around Qt beyond the confines of specific project scopes. Kevin holds a BSc in Software Engineering.","conferences":[],"isDeprecated":false,"name":"Kevin Krammer","publicName":"","sessions":["4334"],"sortGroup":"K","sortKey":"KRAMM","speakerId":4279,"speakerImage":4279,"title":"KDAB"},{"bio":"Senior Software Engineer at KDAB, Paul is a Qt 3D maintainer and active contributor. He has been developing Qt based C++ and QML applications since 2010 and has particular interest and expertise in OpenGL and GPU assisted computing. Paul holds a Master’s degree in Computer Science.","conferences":[],"isDeprecated":false,"name":"Paul Lemire","publicName":"","sessions":["4355","4356"],"sortGroup":"L","sortKey":"LEMIR","speakerId":4268,"speakerImage":4268,"title":"KDAB"},{"bio":"Alex Leutgöb is CTO & Co-Founder of FELGO GmbH (previously called V-Play). Equipped with a business and technical background Alex specialized in mobile app development in 2008 when the first app store launched. Since then he published several apps for customers reaching from small companies to multinational enterprises. With a profound knowledge for the mobile platforms iOS, Android, BlackBerry, Windows Phone, Symbian and MeeGo his apps were downloaded more than a million times. Because of this variety of platforms, he began to evaluate several possibilities for cross-platform development, which finally led to switching his focus on cross-platform mobile app creation with Qt and QML in 2011, when the Felgo framework was born.","conferences":[],"isDeprecated":false,"name":"Alexander Leutgoeb","publicName":"","sessions":["4332"],"sortGroup":"L","sortKey":"LEUTG","speakerId":4264,"speakerImage":4264,"title":"FELGO"},{"bio":"Roman Leykin is the product manager responsible for the HMI Cross-platform Application Toolchain â€“ framework for HMI development which is built using Qt framework and currently used for large European OEM automotive projects. Roman Leykin holds a master degree in mathematics and computer science from Nizhny Novgorod State University (Russia).","conferences":[],"isDeprecated":false,"name":"Roman Leykin","publicName":"","sessions":["4508"],"sortGroup":"L","sortKey":"LEYKI","speakerId":4509,"speakerImage":4509,"title":"HARMAN"},{"bio":"Igor Ljubuncic is a physicist by vocation and a Linux geek by profession. He works as a developer advocate at Canonical, and comes with many years of experience in the industry, including medical, high-performance computing, data center, cloud, and hosting fields. To date, Igor’s portfolio includes 15 patents, 16 books, several open-source projects, numerous articles published in leading journals and magazines, and presentations at prestigious international conferences like LinuxCon, CloudOpen, OpenStack days, IEEE events, and others. In his free time, Igor writes car reviews, fantasy novels and manages his award-winning blog.","conferences":[],"isDeprecated":false,"name":"Igor Ljubuncic","publicName":"","sessions":["4513"],"sortGroup":"L","sortKey":"LJUBU","speakerId":4506,"speakerImage":4506,"title":"Canonical"},{"bio":"Johannes Lochmann has a broad background including geosciences,  pharmacological research, data collection, and analytics.\r\n\r\nCurrently, he is leading software development at TopControl, a leading provider of industrial automation systems for handling, storing,  weighing and packaging of products in the agri-food sector.\r\n\r\nHis first contact with C++ and Qt was established at the end of the nineties and this combination has had a stable place in his toolbox ever since.","conferences":[],"isDeprecated":false,"name":"Johannes Lochmann","publicName":"","sessions":["4414"],"sortGroup":"L","sortKey":"LOCHM","speakerId":4496,"speakerImage":4496,"title":"Top Control"},{"bio":"Yoann Lopes is a Senior Pre-Sales Engineer at The Qt Company and has more than ten years of experience on Qt. Before travelling Europe to meet and advise its various users and customers, he has been working as an R&D software engineer for 7 years, contributing to anything graphics-related in Qt. Besides desktop platforms, he has worked on various embedded and mobile projects, both professionally and in his spare time.","conferences":[],"isDeprecated":false,"name":"Yoann Lopes","publicName":"","sessions":[],"sortGroup":"L","sortKey":"LOPES","speakerId":4269,"title":"The Qt Company"},{"bio":"Chief Technology Officer of Caliatys - Subsidiary of Air Liquide\r\nResponsible for Digital and Embedded application development for IoT and eHealth.\r\nQT enthusiast since beginning, he introduced Qt for mobile applications as an efficient alternative to native developments.\r\nWith his team, they work to integrate industrial protocols and major cloud connectivity (eg. H2 Station finder).\r\nFan of innovation, he works to introduce actor paradigm in Qt as new way to develop multithreaded applications with less pains.\r\nIn parallel of Air Liquide, he manages R&D partnership with L'Oréal Research&Innovation for augmented beauty applications.","conferences":[],"isDeprecated":false,"name":"Nicolas Louis","publicName":"","sessions":["4413"],"sortGroup":"L","sortKey":"LOUIS","speakerId":4511,"speakerImage":4511,"title":"Caliatys"},{"bio":"Cristián has been a Python enthusiast for more than 10 years, and due to his academic background he has been using it in different topics like Image Processing, Artificial Intelligence, Robotics, Data Science, and Astrophysics. Currently he is a Software Engineer at The Qt Company working on the Qt for Python project.","conferences":[],"isDeprecated":false,"name":"Dr. Cristián Maureira-Fredes","publicName":"","sessions":["4344","4345"],"sortGroup":"M","sortKey":"MAURE","speakerId":4281,"speakerImage":4281,"title":"The Qt Company"},{"bio":"Frank Meerkoetter is the Development Lead for basysKom GmbH, where he is consulting customers on industrial and embedded applications, often in combination with Qt. He is responsible for the technical consulting, system- and software-architecture within basysKom. He is the maintainer of Qt OPC UA and a contributor to the Qt project. He has a strong background in Embedded Linux, systems programming, distributed systems and application development. He holds a Master of Computer Science from the University of Applied Sciences in Darmstadt.","conferences":[],"isDeprecated":false,"name":"Frank Meerkötter","publicName":"","sessions":["4323","4329"],"sortGroup":"M","sortKey":"MEERK","speakerId":4271,"speakerImage":4271,"title":"basysKom"},{"bio":"Frank is the development lead at basysKom GmbH where he is providing expertise on system & software architecture in the Qt/C++ area. He has over ten years of experience working with a wide range of Embedded Linux based systems often in combination with Qt.","conferences":[],"isDeprecated":false,"name":"Frank Meerkötter","publicName":"","sessions":[],"sortGroup":"M","sortKey":"MEERK","speakerId":4288,"speakerImage":4288,"title":"basysKom"},{"bio":"Marc Mutz is a Senior Software Engineer with KDAB and author of the “Effective Qt” series of articles. He originated KDAB’s “In-depth Multithreading With Qt”, C++11 and C++17 courses, and runs “-Wmarc”, a blog about Qt, C++ and Boost. The second-most prolific contributor to QtBase and former maintainer of the QtWidgets module, he has actively used the framework for more than a decade, first as a KDE contributor, and then on the job. His most recent contribution to Qt is QStringView, a revolutionary abstraction of string data from containers. Marc is a sought-after speaker at conferences on Qt and C++ topics and holds an MSc in Theoretical Physics.","conferences":[],"isDeprecated":false,"name":"Marc Mutz","publicName":"","sessions":["4325"],"sortGroup":"M","sortKey":"MUTZ","speakerId":4292,"speakerImage":4292,"title":"KDAB"},{"bio":"Nathalie Nahai is an international speaker and author of the best-selling book, Webs of Influence: The Psychology of Online Persuasion (Pearson), now translated in 7 languages. Her work explores the intersection between persuasive technology, ethics, and the psychology of online behaviour.\r\n\r\nFrom psychologically optimising the customer experience to creating engaging content and building reputational resilience, Nathalie’s work explores how brands can apply the latest insights from the worlds of psychology, neuroscience and behavioural economics to succeed online.","conferences":[],"isDeprecated":false,"name":"Nathalie Nahai","publicName":"","sessions":["4409"],"sortGroup":"N","sortKey":"NAHAI","speakerId":4442,"speakerImage":4442,"title":"Web psychologist and author"},{"bio":"Thomas is the product manager for Web Applications on Chrome, overseeing Chrome's efforts to empower applications on the web. He is a strong believer in the open web and works to empower any content to run in the browser. Through new technologies like WebAssembly, advanced capabilities, and Progressive Web Apps he hopes to empower web apps to be as powerful and useful as their native counterparts.","conferences":[],"isDeprecated":false,"name":"Thomas Nattestad","publicName":"","sessions":["4408"],"sortGroup":"N","sortKey":"NATTE","speakerId":4312,"speakerImage":4312,"title":"Google"},{"bio":"Andy Nichols is a software engineer at The Qt Company and has been working on the Qt framework for over a decade. He is currently the maintainer of the Qt Quick Scene Graph and has been focused on providing solutions optimized for embedded hardware. In the past, he has worked on the Qt Platform Abstraction, Qt Wayland (former maintainer), Qt Multimedia, Qt for Embedded Linux as well as Boot to Qt, and more recently Qt 3D and Qt 3D Studio.","conferences":[],"isDeprecated":false,"name":"Andy Nichols","publicName":"","sessions":["4331"],"sortGroup":"N","sortKey":"NICHO","speakerId":4255,"speakerImage":4255,"title":"The Qt Company"},{"bio":"Przemyslaw Nogaj is a Technical Project Lead at Siili Solutions. He spent last decade on developing Qt based applications for desktop, mobile and embedded platforms for multiple industries like e.g. telecommunication, maritime, automotive, IoT. He always puts end user at first place, constantly looking for ways to improve user experience, look and feel and intuitiveness of applications he is developing. For the last year he explores Qt usage on low end devices trying to squeeze all the power out of different MCUs.","conferences":[],"isDeprecated":false,"name":"Przemyslaw Nogaj","publicName":"","sessions":["4387"],"sortGroup":"N","sortKey":"NOGAJ","speakerId":4514,"speakerImage":4514,"title":"Siili Solutions"},{"bio":"Kavindra Palaraja is an experienced Senior Technical Writer who started out writing documentation for Qt ages ago. A former perfectionist, she’s now a strong advocate of small but timely documentation fixes instead of large rewrites or outdated content. Currently she is employed at Luxoft, working on the Qt Automotive Suite.","conferences":[],"isDeprecated":false,"name":"Kavindra Palaraja","publicName":"","sessions":["4363"],"sortGroup":"P","sortKey":"PALAR","speakerId":4301,"speakerImage":4301,"title":"Luxoft"},{"bio":"Kwanghyo is a professional service engineer who works close to the customer on an actual customer products. He also working on an actual customer products, communicates with the customer for their various problems and gives them the solutions to use with Qt.","conferences":[],"isDeprecated":false,"name":"Kwanghyo Park","publicName":"","sessions":["4357"],"sortGroup":"P","sortKey":"PARK","speakerId":4523,"speakerImage":4523,"title":"The Qt Company"},{"bio":"Romain Pokrzywka is the architect for Bluescape's native application, a.k.a. \"The Wall\". He has been developing with Qt for over 15 years on projects spanning desktop, embedded and mobile platforms. He's a QWS regular, having given several talks at past Qt conferences. He’s also a long term contributor to the Qt Project. He has a passion for innovative user interfaces and elegant software architectures to create unique user experiences. A native from France and former Silicon Valley resident, he now lives in Austin, in the heart of Texas.","conferences":[],"isDeprecated":false,"name":"Romain Pokrzywka","publicName":"","sessions":["4376"],"sortGroup":"P","sortKey":"POKRZ","speakerId":4298,"speakerImage":4298,"title":"Bluescape Software"},{"bio":"Koen graduated in Mathematical Engineering in 2008 and went on to complete a PhD in 2012 titled “Quasi-Monte Carlo Methods in Moderate Dimensions: Chebyshev Lattices, Numerical Integration and Particle Filters” as a member of the KULeuven research group for numerical integration and scientific software. During three years at Nikon Metrology NV, he worked on software for coordinate measuring machines and laser scanners. After that, he joined the R&D department at Vandewiele NV, a leading manufacturer of textile machines. He is currently developing Qt applications with a focus on performance, usability, new technologies and cloud integration.","conferences":[],"isDeprecated":false,"name":"Koen Poppe","publicName":"","sessions":["4364"],"sortGroup":"P","sortKey":"POPPE","speakerId":4274,"speakerImage":4274,"title":"Vandewiele"},{"bio":"Dmitriy Purgin is a software developer at sequality software engineering. He has been developing with Qt for over 10 years, starting with pet projects in Qt 3, moving forward to banking applications and ATM systems with Qt 4 and Qt 5, ending up building HMIs for embedded systems with focus on Qt 5 and QML. He was also a full stack developer for 5 years, as well as a part time research contractor at a university for 2 years at the same time. Originally from Kazakhstan and having roots in both Russia and the Ukraine, he now lives in a picturesque place at the Softwarepark Hagenberg in Upper Austria.","conferences":[],"isDeprecated":false,"name":"Dmitriy Purgin","publicName":"","sessions":["4337"],"sortGroup":"P","sortKey":"PURGI","speakerId":4280,"speakerImage":4280,"title":"Sequality"},{"bio":"Andreas Reischuck is the organizer of the C++ Usergroup Dresden in Germany and the Dresden Weekly hacking meetup. In his day job he acts as the CEO of the HicknHack Software GmbH. He advises customers about technology decisions and loves to solve the hard problems. Andreas teaches modern C++, clean code and Qt development to professionals and pupils. He spoke at various usergroups, national and international conferences about a wide variety of topics.","conferences":[],"isDeprecated":false,"name":"Andreas Reischuck","publicName":"","sessions":["4341"],"sortGroup":"R","sortKey":"REISC","speakerId":4304,"speakerImage":4304,"title":"HicknHack Software"},{"bio":"Founder, innovator, and inveterate inventor Mate Rimac started out in 2007 at the age of 19 in a borrowed garage. In 2009 Rimac Automobili was born and in 2011 the Rimac Concept_One became the world’s first true electric supercar. With the 2018 launch of the C_Two from a dedicated, skilled, and passionate team in Croatia, Mate looks set to join the pantheon of entrepreneurial businessmen that make their dreams reality and prove that limits are reserved for others. Today, Rimac is recognized as a trusted partner by many global OEMs, trickling-down the hypercar technology to many applications. After two venture capital raising rounds, concluded in June 2018 with a strategic partnership with Porsche AG, Mate remains the majority shareholder of both Rimac and its subsidiary company Greyp Bikes.","conferences":[],"isDeprecated":false,"name":"Mate Rimac","publicName":"","sessions":["4406"],"sortGroup":"R","sortKey":"RIMAC","speakerId":4438,"speakerImage":4438,"title":"Rimac Automobili"},{"bio":"Alex Rössler is a Machine Tool UI Consultant. Two years ago he started his company Machine Koder dedicated to creating beautiful and easy-to-use UIs for machine tools. He worked with Qt/C++ for more than a decade before starting to explore the possibilities of Qt/Python.","conferences":[],"isDeprecated":false,"name":"Alexander Rössler","publicName":"","sessions":["4368"],"sortGroup":"R","sortKey":"RÖSSL","speakerId":4273,"speakerImage":4273,"title":"Machine Koder"},{"bio":"Tero is product and engineering leader with over 20 years of experience from developing SW platforms for telecommunications equipment,\r\n\r\nmobile phones and various other embedded devices.\r\n\r\nCurrently he is working with virtualization and related standardization for automotive domain.","conferences":[],"isDeprecated":false,"name":"Tero Salminen","publicName":"","sessions":["4348"],"sortGroup":"S","sortKey":"SALMI","speakerId":4300,"speakerImage":4300,"title":"OpenSynergy"},{"bio":"Günter is working with Qt for many 20 years. He worked on many different Qt and QML based projects of all different kinds. Desktop, mobile, embedded, OSS world top corporations and small startups. With every new project, there are new lessons to learn and new knowledge to share. Since several years he works as Qt/QML consultant for Viking Software.","conferences":[],"isDeprecated":false,"name":"Günter Schwann","publicName":"","sessions":["4365"],"sortGroup":"S","sortKey":"SCHWA","speakerId":4308,"speakerImage":4308,"title":"Viking Software"},{"bio":"Pascal Seifert studied design at the Anhalt University of Applied Sciences from 2002 to 2007. He has been working in the automotive-design visualization and virtual-reality domain for the last 10 years, and he has developed a variety of qualities and skills in the whole virtual-product lifecycle process. He possesses expert knowledge in database, handling file conversion and data preparation, and he presents the results in design or immersive engineering environments. Currently, he is a caretaker for Autodesk, Inc., automotive customers around the globe, using his modeling and visualization experience to help the digital design phase.","conferences":[],"isDeprecated":false,"name":"Pascal Seifert","publicName":"","sessions":["4353"],"sortGroup":"S","sortKey":"SEIFE","speakerId":4314,"speakerImage":4314,"title":"Autodesk"},{"bio":"Software engineer at KDAB, André has been using Qt since 2002 when he wrote an open source Qt 2-based flight computer for use in glider planes. Since then, he has applied Qt in a broad range of industries ranging from oil & gas exploration, scientific data manipulation and visualization to medical devices and many more. His main expertise is in C++ and QML. André holds a MSc in Philosophy of Science & Technology.","conferences":[],"isDeprecated":false,"name":"André Somers","publicName":"","sessions":["4326","4335"],"sortGroup":"S","sortKey":"SOMER","speakerId":4262,"speakerImage":4262,"title":"KDAB"},{"bio":"Reginald Stadlbauer was born in Graz, Austria where he attended high school and then the Technical University of Graz.\r\n\r\nAn interest in computers and programming began when Reginald started with BASIC programming, before moving on to Pascal on an ATARI ST where he became interested in GUI programming. He started working with C++ and Qt® after he joined the \"KDE\":http://www.kde.org team in the summer of 1997 – he worked on KWord, and developed the initial version of KPresenter.\r\n\r\nReginald started working for Trolltech® AS as a software engineer, in the summer of 1999. During his four years at Trolltech, Reginald worked on several major projects, spending most of his time doing development, but also doing release management and training and mentoring other developers. He was a software architect and the lead developer for the Qt Designer GUI builder, he was one of the architects of Trolltech's Qt/Desktop product, he led the development of Qt's complex widgets, and he was also part of the architecture and implementation team for QSA - Qt Script for Applications.\r\n\r\nReginald co-founded froglogic in 2003.","conferences":[],"isDeprecated":false,"name":"Reginald Stadlbauer","publicName":"","sessions":["4375"],"sortGroup":"S","sortKey":"STADL","speakerId":4548,"speakerImage":4548,"title":"froglogic"},{"bio":"Senior Software Developer at KDAB, Christoph has been developing with C++ for over 15 years, and Qt for the last 7. A contributor to Gammaray, KDAB's in-depth Qt-Analysis-Tool, Christoph specializes in performance optimization for embedded systems - from Industrial Automation to Automotive In-Car Entertainment Systems - and has consulted large software teams on Qt/QML. He has published on Human-Computer-Interaction, Distributed Systems, and IT-Security and was awarded an M.Sc. in IT-Systems Engineering with distinction.","conferences":[],"isDeprecated":false,"name":"Christoph Sterz","publicName":"","sessions":["4385"],"sortGroup":"S","sortKey":"STERZ","speakerId":4263,"speakerImage":4263,"title":"KDAB"},{"bio":"Burkhard has been working with Qt ever since version 1.44 back in 1999. He has developed quite a few embedded and desktop applications with Qt and QML. His major products include driver terminals for forage and sugar beet harvesters, infotainment systems for US and European car OEMs, an in-flight entertainment system and a display computer for e-bikes. He has worked as an evangelist for Nokia's Qt team and has convinced well-known companies from the automotive, STB/TV and home appliance industry to use Qt. He was the first to give QML trainings back in early 2010, when QML was still far away from an alpha release. The business connections from his Nokia times made it easy for Burkhard to quit his permanent job six years ago and to start working as an independent consultant. He offers professional services for developing embedded systems - preferably with a QML GUI and Qt/C++ middleware. Burkhard worked and lived in India, England and Norway and moved back to his native country, Germany, a couple of years ago. In his spare time, he is hiking, biking and skiing through the Bavarian Alpes.","conferences":[],"isDeprecated":false,"name":"Burkhard Stubert","publicName":"","sessions":["4317"],"sortGroup":"S","sortKey":"STUBE","speakerId":4313,"speakerImage":4313,"title":"Consultant"},{"bio":"Morten Johan Sørvig works at the Qt Company Oslo as Senior Software Engineer and is the Qt for macOS maintainer. He has been working on Qt for more than 14 years after starting as a software engineer at Trolltech in 2004. In addition to his maintainer role Morten has also contributed to Qt’s high-DPI support and Qt for WebAssembly port.","conferences":[],"isDeprecated":false,"name":"Morten Sørvig","publicName":"","sessions":["4360"],"sortGroup":"S","sortKey":"SØRVI","speakerId":4270,"speakerImage":4270,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"TBC ","publicName":"","sessions":["4614"],"sortGroup":"T","sortKey":"TBC","speakerId":4615,"title":"LG Electronics"},{"bio":"Bo has been a part of the Qt community since 1997. He has the kind of deep knowledge that only comes from many years of Qt coding. These days he runs Viking Software, one of the Qt based service companies. He is known to give talks at World Summit which are both enlightening and entertaining.","conferences":[],"isDeprecated":false,"name":"Bo Thorsen","publicName":"","sessions":["4333","4388","4391"],"sortGroup":"T","sortKey":"THORS","speakerId":4258,"speakerImage":4258,"title":"Viking Software"},{"bio":"Jeff Tranter is a Qt Consulting Manager at Integrated Computer Solutions (ICS). At ICS, Jeff is responsible for the management of customer software projects, including the architectural and high-level design of software systems. Prior to joining ICS, Jeff was one of the founding members of Xandros Corporation where he managed a team of developers responsible for the desktop components of Linux-based Xandros Desktop products. Jeff has written a number of books on Linux and Open Source programming as well as numerous magazine articles and has given presentations at conferences and user groups.","conferences":[],"isDeprecated":false,"name":"Jeff Tranter","publicName":"","sessions":["4382"],"sortGroup":"T","sortKey":"TRANT","speakerId":4282,"speakerImage":4282,"title":"ICS"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Adam Treat","publicName":"","sessions":["4628"],"sortGroup":"T","sortKey":"TREAT","speakerId":4627,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"David Tsai　様","publicName":"","sessions":["4601"],"sortGroup":"T","sortKey":"TSAI　","speakerId":4572,"title":"Delta Electronics"},{"bio":"Tuukka Turunen is leading R&D at The Qt Company. Tuukka holds M.Sc.(Eng) and Licentiate of Technology from the University of Oulu, Finland. He has over 20 years of experience from various positions in the software industry, especially around embedded systems","conferences":[],"isDeprecated":false,"name":"Tuukka Turunen","publicName":"","sessions":["4432"],"sortGroup":"T","sortKey":"TURUN","speakerId":4436,"speakerImage":4436,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"Juha Varelius","publicName":"","sessions":["4639"],"sortGroup":"V","sortKey":"VAREL","speakerId":4634,"title":"The Qt Company"},{"bio":"Senior software engineer at KDAB, Bogdan Vatra has been using Qt since 2002 and is the author of the Qt for Android port. He is a regular contributor to Qt and currently the maintainer of the Qt Android platform and QtCreator Android plugin.","conferences":[],"isDeprecated":false,"name":"Bogdan Vatra","publicName":"","sessions":["4377"],"sortGroup":"V","sortKey":"VATRA","speakerId":4316,"speakerImage":4316,"title":"KDAB"},{"bio":"Milian Wolff has a long history of creating tools for C++ developers. He's the main author of Massif-Visualizer, heaptrack, hotspot and ctf2ctf tools now used widely to improve C++ applications performance. He's a Senior Software Engineer at KDAB where he enjoys solving hard performance problems and teaching developers about debugging and profiling tools. Milian has a Masters Degree in Physics which explains his a scientific approach to performance measurements.","conferences":[],"isDeprecated":false,"name":"Milian Wolff","publicName":"","sessions":["4371"],"sortGroup":"W","sortKey":"WOLFF","speakerId":4289,"speakerImage":4289,"title":"KDAB"},{"bio":"Sharon Woods is a Senior Software Engineer in the Qt Company’s Professional Services who discovered the possibilities of Shiboken while working on Qt for Python projects for customers. She is based out of the Boston, MA office and has been developing applications for research and commercial customers for 20 years.","conferences":[],"isDeprecated":false,"name":"Sharon Woods","publicName":"","sessions":["4346"],"sortGroup":"W","sortKey":"WOODS","speakerId":4276,"speakerImage":4276,"title":"The Qt Company"},{"bio":"Becky Worledge has been working in the Qt Professional Services team since 2011. Initially based in Oulu, Finland, she relocated to Santa Clara California in 2015. For the last year she has been working in a UI team that included several designers. This meant recreating a lot of amazing designs directly in the Qt parts, so when she heard about QtLottie, well, she was intrigued.","conferences":[],"isDeprecated":false,"name":"Becky Worledge","publicName":"","sessions":["4319","4330"],"sortGroup":"W","sortKey":"WORLE","speakerId":4260,"speakerImage":4260,"title":"The Qt Company"},{"bio":"Torsten Wylegala was born in 1990 and is a research assistant at the division for automotive computer science (faculty for automotive engineering) at the Ostfalia University of Applied Science (UAS) in Wolfsburg, Germany. He graduated with a Bachelor of Engineering degree in Automotive Computer Science (Ostfalia UAS, 2011-2014) and a Master of Science degree in Computer and Communications Systems Engineering (TU Braunschweig, 2014-2016). Prior to his current position, he worked for the tarent solutions GmbH (Bonn) as a software engineer and for the Volkswagen AG (Wolfsburg) as an engineer for electronic control unit prototypes (hard- and software). His educational work focuses on teaching programming skills (C/C++) from beginners to advanced levels and support of student-based research in the field of electronic- and software systems for automotive applications. Furthermore, he is the faculty adviser for the student project “e.Wolf” (https://ewolf.ostfalia.de/) which aims to develop a fully autonomous model car (scale 1:10) and compete in the annual “Carolo-Cup” (https://wiki.ifr.ing.tu-bs.de/carolocup/en). His research topics include advanced driver-assistance systems, virtual simulation for driver-assistance systems, electrical engineering for control unit prototypes and state of the art HMI systems for automotive applications like assisted driving. He is deeply committed to use as much open source software and hardware as possible in educational, professional and personal projects. His technological toolchain includes tools like GNU/Linux, KiCad, Inkscape and Qt when it comes to graphical user interfaces. In his free time, he likes to combine hard- and software development in various personal projects. As a compensation for his computer based work, he likes mechanical engineering, travelling, doing water sports and handcrafts like furniture design.","conferences":[],"isDeprecated":false,"name":"Torsten Wylegala","publicName":"","sessions":["4349"],"sortGroup":"W","sortKey":"WYLEG","speakerId":4293,"speakerImage":4293,"title":"Ostfalia University of Applied Science"},{"bio":"Jason is a Senior manager of professional services for Korea, China and India.\r\n\r\nBefore joining Qt, he worked for HERE Technology for 4 years as Customer Program Manager II, providing map contents and services to Korea customers like Samsung and LG, etc..\r\n\r\nOriginally he was a software engineer for mobile phone including feature phone and smartphone during over 11 years from Pantech, SK Teletech and LGE.\r\n\r\nThrough these careers, he had diverse experiences and good project management knowledge for the professional services project.\r\n\r\nThis year, he is enjoying to work closely with Hyundai Motor Company, LGE and Hyundai Mobis to make a solid business chain with them through a high level of technical consulting service.","conferences":[],"isDeprecated":false,"name":"Jason Yoon","publicName":"","sessions":[],"sortGroup":"Y","sortKey":"YOON","speakerId":4315,"speakerImage":4315,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"清水 佳之","publicName":"","sessions":["4632"],"sortGroup":"佳","sortKey":"佳之","speakerId":4620,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"原木 俊壽　様","publicName":"","sessions":["4596"],"sortGroup":"俊","sortKey":"俊壽　様","speakerId":4568,"title":"スズキ株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"盛 信一　様","publicName":"","sessions":["4597"],"sortGroup":"信","sortKey":"信一　様","speakerId":4569,"title":"株式会社ニコン"},{"bio":"Qtを活用するメリットと、それを業務上どのように活用しているのか、ご紹介いただきます。","conferences":[],"isDeprecated":false,"name":"池添 剛　様","publicName":"","sessions":["4600"],"sortGroup":"剛","sortKey":"剛　様","speakerId":4567,"title":"シュナイダーエレクトリックジャパンホールディングス株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"朝木 卓見　様","publicName":"","sessions":["4606"],"sortGroup":"卓","sortKey":"卓見　様","speakerId":4580,"title":"株式会社SRA"},{"bio":"","conferences":[],"isDeprecated":false,"name":"市川 博徳　様","publicName":"","sessions":["4605"],"sortGroup":"博","sortKey":"博徳　様","speakerId":4579,"title":"MathWorks Japan"},{"bio":"","conferences":[],"isDeprecated":false,"name":"鈴木 啓高　様","publicName":"","sessions":["4610"],"sortGroup":"啓","sortKey":"啓高　様","speakerId":4584,"title":"エスディーテック株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"蔭山 壽志様","publicName":"","sessions":["4609"],"sortGroup":"壽","sortKey":"壽志様","speakerId":4583,"title":"Monotype株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"坂本 強","publicName":"","sessions":["4631"],"sortGroup":"強","sortKey":"強","speakerId":4621,"title":"The Qt Company"},{"bio":"","conferences":[],"isDeprecated":false,"name":"夏井 敏樹　様","publicName":"","sessions":["4598"],"sortGroup":"敏","sortKey":"敏樹　様","speakerId":4570,"title":"オムロン株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"吉川 武宏　様","publicName":"","sessions":["4629"],"sortGroup":"武","sortKey":"武宏　様","speakerId":4623,"title":"株式会社SRA"},{"bio":"","conferences":[],"isDeprecated":false,"name":"山本 直樹　様","publicName":"","sessions":["4599"],"sortGroup":"直","sortKey":"直樹　様","speakerId":4571,"title":"ルネサス エレクトロニクス 株式会社"},{"bio":"1980年にエンジン制御から始まったマイコンを使った電子制御システムは急速な勢いで「数の拡大」と「制御の高度化」が進んでいます。\r\nトヨタ自動車として、電子制御システムの拡大/複雑化に対応してきた歴史を踏まえて、制御システム・ソフトウェア開発の現状と課題、その課題を解決するための取り組みをご紹介いただきます。","conferences":[],"isDeprecated":false,"name":"石井 聡　様","publicName":"","sessions":["4566"],"sortGroup":"聡","sortKey":"聡　様","speakerId":4562,"title":"トヨタ自動車株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"吉田 雄　様","publicName":"","sessions":[],"sortGroup":"雄","sortKey":"雄　様","speakerId":4578,"title":"パナソニックITS株式会社"},{"bio":"","conferences":[],"isDeprecated":false,"name":"井上 雅裕　様、吉田 雄　様<br>","publicName":"","sessions":["4604"],"sortGroup":"雄","sortKey":"雄　様<B","speakerId":4577,"title":"パナソニックITS株式会社"}]